{"title":{"titleText":"Процедура Assign","type":"Процедура"},"description":[{"type":"text","data":"Процедура Assign(F; Name) назначает файловой переменной F имя внешнего файла Name."},{"type":"subtitle","data":"Объявление:"},{"type":"text","data":"Procedure Assign(Var F; Name : String);\r\n"},{"type":"subtitle","data":"Режим:"},{"type":"text","data":"Windows, Real, Protected"},{"type":"subtitle","data":"Замечание:"},{"type":"text","data":"Параметр F - файловая переменная любого файлового типа, а Name - выражение со строковым типом или выражение типа PChar, если допускается расширенный синтаксис. Все дальнейшие операции с переменной F на самом деле происходят с внешним файлом с именем Name. После обращения к Assign, связь между переменной F и внешним файлом продолжает существовать до тех пор, пока для переменной F не будет сделано еще одно переназначение. Имя файла состоит из пути - нулевого или большего количества имен каталогов, разделенных левыми наклонными чертами, сопровождаемого собственно именем файла: Drive:\\DirName\\...\\DirName\\FileName.Ext Если путь начинается с левой наклонной черты, то он находится в корневом каталоге, иначе, он находится в текущем каталоге. Drive - идентификатор дисковода (A-Z). Если Drive и двоеточие опущены, то используется заданный по умолчанию дисковод. \\DirName\\...\\DirName - корневой каталог и подкаталоги в пути к файлу. Имя файла состоит из имени, длиной до восьми символов, возможно сопровождаемых точкой и расширения, длиной до трех символов. Максимальная длина всего имени файла вместе с путем - 79 символов. Если String - пустая строка, то есть когда Length(Name) равно нулю, то возникает специальный случай и переменная F становится связанной со стандартным файлом ввода или вывода. Эти специальные файлы позволяют программе использовать возможность операционной системы DOS - возможность переназначения ввода/вывода. Если переменной F назначено пустое имя, то после обращения к Reset(F), F относится к стандартному устройству ввода, а после обращения к ReWrite(F), F относится к стандартному устройству вывода."},{"type":"subtitle","data":"Ограничения:"},{"type":"text","data":"Не может использоваться для открытых файлов."},{"type":"subtitle","data":"Пример:"},{"type":"code","data":"{Пример программы для процедуры Assign.}\r\n\r\nVar F : Text;\r\n\r\nBegin\r\n\tAssign(F, 'test.txt');\r\n\tReWrite(F);\r\n\tWriteLn(F, 'Это файл test.txt');\r\n\tClose(F)\r\nEnd."},{"type":"subtitle","data":"Описание примера:"},{"type":"text","data":"Эта программа сначала назначает файловой переменной \"F\" имя файла \"test.txt\" (Assign(F, 'test.txt');), после чего открывает данный файл для перезаписи (ReWrite(F);) и записывает строку \"Это файл test.txt\"(WriteLn(F, 'Это файл test.txt');). По окончанию работы закрываем файл(Close(F))."}]}